/* -----------------------------------------------------------------------------
  主模块main：
  1. 配置模块路径
  2. 引用模块
----------------------------------------------------------------------------- */

/* ------------------- 配置 ------------------- */
Require.config({
  paths: {
    'A': '/javascripts/moduleA.js',
    'B': '/javascripts/moduleB.js',
    'C': '/javascripts/moduleC.js',
  }
});

/* ------------------- 引用 ------------------- */
Require.require(['A', 'B', 'C'], function (a, b, c) {
  a.log();
  b.log();
  c.log();
});
